---
kind: property
id: P:Autodesk.Revit.DB.Analysis.AnalysisResultSchema.IsVisible
source: html/36b89145-ea4a-cba4-bcb1-29ee7b02db41.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisResultSchema.IsVisible Property

If true analysis result is visible in view

## Syntax (C#)
```csharp
public bool IsVisible { get; set; }
```